Revit 2024 API
MEPSize Properties
The MEPSize type exposes the following members.
Properties
Name | Description
InnerDiameter
 Inner diameter
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
NominalDiameter
 Nominal diameter
OuterDiameter
 Outer diameter
UsedInSizeLists
 Whether it is used in size lists.
UsedInSizing
 Whether is used in sizing.
See Also
MEPSize Class
Autodesk.Revit.DB Namespace